In [1]:
import numpy as np
import pandas as pd

In [2]:
dictionary_data = {"Istanbul": [32, 29, np.nan], "Ankara": [24, np.nan, 26], "Izmir": [36, 34, 33]}

In [3]:
dictionary_data

{'Istanbul': [32, 29, nan], 'Ankara': [24, nan, 26], 'Izmir': [36, 34, 33]}

In [4]:
weather_data_frame = pd.DataFrame(dictionary_data)

In [5]:
weather_data_frame

   Istanbul  Ankara  Izmir
0      32.0    24.0     36
1      29.0     NaN     34
2       NaN    26.0     33

In [6]:
weather_data_frame.dropna()

   Istanbul  Ankara  Izmir
0      32.0    24.0     36

In [7]:
weather_data_frame.dropna(axis=1)

   Izmir
0     36
1     34
2     33

In [9]:
dictionary_data_2 = {"Istanbul": [32, 29, np.nan], "Ankara": [24, np.nan, 26], "Izmir": [36, 34, 33], "Antalya": [45,np.nan,np.nan]}

In [12]:
dictionary_data_2

{'Istanbul': [32, 29, nan],
 'Ankara': [24, nan, 26],
 'Izmir': [36, 34, 33],
 'Antalya': [45, nan, nan]}

In [10]:
weather_data_frame_2 = pd.DataFrame(dictionary_data_2)

In [11]:
weather_data_frame_2

   Istanbul  Ankara  Izmir  Antalya
0      32.0    24.0     36     45.0
1      29.0     NaN     34      NaN
2       NaN    26.0     33      NaN

In [13]:
weather_data_frame_2.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      32.0    24.0     36
1      29.0     NaN     34
2       NaN    26.0     33

In [14]:
weather_data_frame_2.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      32.0    24.0     36     45.0
1      29.0    20.0     34     20.0
2      20.0    26.0     33     20.0

## GROUPBY

In [19]:
salary_dictionary = {"Departman": ["Yazılım", "Yazılım", "Pazarlama", "Pazarlama", "Hukuk", "Hukuk"],
                    "Calisan Ismi": ["Osman", "Kagan", "Ahmet", "Ali", "Melih", "Recep"],
                     "Maas": [30000, 25000, 34000, 16000, 21000, 27000]
                    }

In [20]:
salary_data_frame = pd.DataFrame(salary_dictionary)

In [21]:
salary_data_frame

   Departman Calisan Ismi   Maas
0    Yazılım        Osman  30000
1    Yazılım        Kagan  25000
2  Pazarlama        Ahmet  34000
3  Pazarlama          Ali  16000
4      Hukuk        Melih  21000
5      Hukuk        Recep  27000

In [26]:
group_object = salary_data_frame.groupby("Departman")

In [29]:
group_object.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [34]:
group_object.mean("Maas")

              Maas
Departman
Hukuk      24000.0
Pazarlama  25000.0
Yazılım    27500.0

In [35]:
group_object.min()

          Calisan Ismi   Maas
Departman
Hukuk            Melih  21000
Pazarlama        Ahmet  16000
Yazılım          Kagan  25000

In [36]:
group_object.max()

          Calisan Ismi   Maas
Departman
Hukuk            Recep  27000
Pazarlama          Ali  34000
Yazılım          Osman  30000

In [37]:
group_object.describe()

           Maas                                                             \
          count     mean           std      min      25%      50%      75%
Departman
Hukuk       2.0  24000.0   4242.640687  21000.0  22500.0  24000.0  25500.0
Pazarlama   2.0  25000.0  12727.922061  16000.0  20500.0  25000.0  29500.0
Yazılım     2.0  27500.0   3535.533906  25000.0  26250.0  27500.0  28750.0


               max
Departman
Hukuk      27000.0
Pazarlama  34000.0
Yazılım    30000.0